InformationRegisters/МеткиВремениДанныхЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>МеткиВремениДанныхЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МеткаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСинхронизацииСЦентромЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыСинхронизацииСЦентромЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСинхронизацииСЦентромЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДокументыЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриглашенияЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчетныеЗаписиЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДанныеДокументовЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтатусыДоверенностей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортныеКонтейнерыЭДО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/МеткиВремениДанныхЭДО/Ext/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  Источник - ДокументОбъект.ЭлектронныйДокументВходящийЭДО
//           - ДокументОбъект.ЭлектронныйДокументИсходящийЭДО
Процедура ЗафиксироватьПоДокументу(Источник) Экспорт
	
	Зафиксировать(Источник.ИдентификаторОрганизации,
		Перечисления.ТипыСинхронизацииСЦентромЭДО.ДокументыЭДО,
		Источник.ИдентификаторДокумента);
	
КонецПроцедуры

// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.СостоянияДокументовЭДО
//           - РегистрСведенийНаборЗаписей.СоставПакетовДокументовЭДО
//           - РегистрСведенийНаборЗаписей.ПроверкиЭлектронныхПодписейЭДО
//           - РегистрСведенийНаборЗаписей.ПриглашенияКОбменуЭлектроннымиДокументами
//           - РегистрСведенийНаборЗаписей.УчетныеЗаписиЭДО
//  Замещение - Булево
Процедура ЗафиксироватьПоНаборуЗаписей(Источник, Замещение) Экспорт
	
	ТипИсточника = ТипЗнч(Источник);
	Если ТипИсточника = Тип("РегистрСведенийНаборЗаписей.СостоянияДокументовЭДО")
		ИЛИ ТипИсточника = Тип("РегистрСведенийНаборЗаписей.СоставПакетовДокументовЭДО")
		ИЛИ ТипИсточника = Тип("РегистрСведенийНаборЗаписей.ПроверкиЭлектронныхПодписейЭДО") Тогда
		ЗафиксироватьПоНаборуЗаписейДляДокументаЭДО(Источник, Замещение);
	ИначеЕсли ТипИсточника = Тип("РегистрСведенийНаборЗаписей.ПриглашенияКОбменуЭлектроннымиДокументами") Тогда
		ЗафиксироватьПоНаборуЗаписейДляПриглашенияЭДО(Источник, Замещение);
	ИначеЕсли ТипИсточника = Тип("РегистрСведенийНаборЗаписей.УчетныеЗаписиЭДО") Тогда
		ЗафиксироватьПоНаборуЗаписейДляУчетнойЗаписиЭДО(Источник, Замещение);
	Иначе
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Не удалось зафиксировать метку времени. Неизвестный источник данных: %1'"), Источник);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.СостоянияДокументовЭДО
//           - РегистрСведенийНаборЗаписей.СоставПакетовДокументовЭДО
//           - РегистрСведенийНаборЗаписей.ПроверкиЭлектронныхПодписейЭДО
//  Замещение - Булево
Процедура ЗафиксироватьПоНаборуЗаписейДляДокументаЭДО(Источник, Замещение)
	
	Если ЗафиксироватьПоНаборуЗаписейСОтборомДляДокументаЭДО(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияБЭД.ЭтоЗамещениеНабораЗаписей(Замещение) Тогда
		ЗафиксироватьПоНаборуЗаписейСЗамещениемДляДокументаЭДО(Источник);
	Иначе
		ЗафиксироватьПоНаборуЗаписейБезЗамещенияДляДокументаЭДО(Источник);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Источник - см. ЗафиксироватьПоНаборуЗаписейДляДокументаЭДО.Источник
// 
// Возвращаемое значение:
//  Булево
Функция ЗафиксироватьПоНаборуЗаписейСОтборомДляДокументаЭДО(Источник)
	
	ЭлектронныйДокумент = Источник.Отбор.ЭлектронныйДокумент.Значение; // ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
	Если Не ЗначениеЗаполнено(ЭлектронныйДокумент) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.ДокументыЭДО;
	СвойстваДокумента = Неопределено;
	Если Не Источник.ДополнительныеСвойства.Свойство("СвойстваДокумента", СвойстваДокумента) Тогда
		СвойстваДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлектронныйДокумент,
			"ИдентификаторОрганизации, ИдентификаторДокумента"); // Структура
	КонецЕсли;
	
	Зафиксировать(СвойстваДокумента.ИдентификаторОрганизации, ТипДанных, СвойстваДокумента.ИдентификаторДокумента);
	
	Возврат Истина;
	
КонецФункции 

// Параметры:
//  Источник - см. ЗафиксироватьПоНаборуЗаписейДляДокументаЭДО.Источник
Процедура ЗафиксироватьПоНаборуЗаписейСЗамещениемДляДокументаЭДО(Источник)
	
	ВыгрузкаИзменений = ВыгрузкаИзмененийПоНаборуЗаписейДляДокументовЭДО(Источник);
	Если Не ЗначениеЗаполнено(ВыгрузкаИзменений) Тогда
		Возврат;
	КонецЕсли;
	
	ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.ДокументыЭДО;
	ДокументыЭДО = ВыгрузкаИзменений.ВыгрузитьКолонку("ЭлектронныйДокумент"); // Массив из ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
	РеквизитыДокументовЭДО = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ДокументыЭДО,
		"ИдентификаторОрганизации, ИдентификаторДокумента");
	
	Для Каждого РеквизитыДокументаЭДО Из РеквизитыДокументовЭДО Цикл
		ЗначенияРеквизитов = РеквизитыДокументаЭДО.Значение;
		Зафиксировать(ЗначенияРеквизитов.ИдентификаторОрганизации, ТипДанных, ЗначенияРеквизитов.ИдентификаторДокумента);
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  Источник - см. ЗафиксироватьПоНаборуЗаписейДляДокументаЭДО.Источник
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//  * ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
Функция ВыгрузкаИзмененийПоНаборуЗаписейДляДокументовЭДО(Источник)
	Возврат МеткиВремениДанныхЭДО.ВыгрузкаИзмененийПоНаборуЗаписей(Источник);
КонецФункции

// Параметры:
//  Источник - см. ЗафиксироватьПоНаборуЗаписейДляДокументаЭДО.Источник
Процедура ЗафиксироватьПоНаборуЗаписейБезЗамещенияДляДокументаЭДО(Источник)
	
	ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.ДокументыЭДО;
	ЭлектронныеДокументы = Источник.Выгрузить().ВыгрузитьКолонку("ЭлектронныйДокумент");
	РеквизитыДокументов = РеквизитыЭлектронныхДокументов(ЭлектронныеДокументы);
	
	Для Каждого ЗаписьНабора Из Источник Цикл
		ЭлектронныйДокумент = ЗаписьНабора.ЭлектронныйДокумент;
		РеквизитыДокумента = РеквизитыДокументов[ЭлектронныйДокумент]; // Строка
		Если Не ЗначениеЗаполнено(РеквизитыДокумента) Тогда
			Продолжить;
		КонецЕсли;
		Зафиксировать(РеквизитыДокумента.ИдентификаторОрганизации,
			ТипДанных, РеквизитыДокумента.ИдентификаторДокумента);
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  ЭлектронныеДокументы - Массив из ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
//  * Значение - Структура:
//    ** ИдентификаторОрганизации - Строка
//    ** ИдентификаторДокумента - Строка
Функция РеквизитыЭлектронныхДокументов(ЭлектронныеДокументы)
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ЭлектронныеДокументы,
		"ИдентификаторОрганизации, ИдентификаторДокумента");
КонецФункции

// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.ПриглашенияКОбменуЭлектроннымиДокументами
//  Замещение - Булево
Процедура ЗафиксироватьПоНаборуЗаписейДляПриглашенияЭДО(Источник, Замещение)
	
	Если ЗафиксироватьПоНаборуЗаписейСОтборомДляПриглашенияЭДО(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияБЭД.ЭтоЗамещениеНабораЗаписей(Замещение) Тогда
		ЗафиксироватьПоНаборуЗаписейСЗамещениемДляПриглашенияЭДО(Источник);
	Иначе
		ЗафиксироватьПоНаборуЗаписейБезЗамещенияДляПриглашенияЭДО(Источник);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Источник - см. ЗафиксироватьПоНаборуЗаписейДляПриглашенияЭДО.Источник
// 
// Возвращаемое значение:
//  Булево
Функция ЗафиксироватьПоНаборуЗаписейСОтборомДляПриглашенияЭДО(Источник)
	
	ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.ПриглашенияЭДО;
	
	Ключ = Источник.Отбор.Ключ.Значение; // Строка
	ИдентификаторЭДО = Источник.Отбор.ИдентификаторОрганизации.Значение; // Строка
	Если ЗначениеЗаполнено(Ключ) И ЗначениеЗаполнено(ИдентификаторЭДО) Тогда
		Зафиксировать(ИдентификаторЭДО, ТипДанных, Ключ);
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Параметры:
//  Источник - см. ЗафиксироватьПоНаборуЗаписейДляПриглашенияЭДО.Источник
Процедура ЗафиксироватьПоНаборуЗаписейСЗамещениемДляПриглашенияЭДО(Источник)
	
	ВыгрузкаИзменений = ВыгрузкаИзмененийПоНаборуЗаписейДляПриглашенийЭДО(Источник);
	Если Не ЗначениеЗаполнено(ВыгрузкаИзменений) Тогда
		Возврат;
	КонецЕсли;
	
	ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.ПриглашенияЭДО;
	Для Каждого ЗаписьВызрузки Из ВыгрузкаИзменений Цикл
		Зафиксировать(ЗаписьВызрузки.ИдентификаторОрганизации, ТипДанных, ЗаписьВызрузки.Ключ);
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  Источник - см. ЗафиксироватьПоНаборуЗаписейДляПриглашенияЭДО.Источник
Процедура ЗафиксироватьПоНаборуЗаписейБезЗамещенияДляПриглашенияЭДО(Источник)
	
	ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.ПриглашенияЭДО;
	Для Каждого ЗаписьНабора Из Источник Цикл
		Зафиксировать(ЗаписьНабора.ИдентификаторОрганизации, ТипДанных, ЗаписьНабора.Ключ);
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  Источник - см. ЗафиксироватьПоНаборуЗаписейДляПриглашенияЭДО.Источник
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//  * Ключ - Строка
//  * ИдентификаторОрганизации - Строка
Функция ВыгрузкаИзмененийПоНаборуЗаписейДляПриглашенийЭДО(Источник)
	Возврат МеткиВремениДанныхЭДО.ВыгрузкаИзмененийПоНаборуЗаписей(Источник);
КонецФункции

// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.УчетныеЗаписиЭДО
//  Замещение - Булево
Процедура ЗафиксироватьПоНаборуЗаписейДляУчетнойЗаписиЭДО(Источник, Замещение)
	
	Если ЗафиксироватьПоНаборуЗаписейСОтборомДляУчетнойЗаписиЭДО(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияБЭД.ЭтоЗамещениеНабораЗаписей(Замещение) Тогда
		ЗафиксироватьПоНаборуЗаписейСЗамещениемДляУчетнойЗаписиЭДО(Источник);
	Иначе
		ЗафиксироватьПоНаборуЗаписейБезЗамещенияДляУчетнойЗаписиЭДО(Источник);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Источник - см. ЗафиксироватьПоНаборуЗаписейДляУчетнойЗаписиЭДО.Источник
// 
// Возвращаемое значение:
//  Булево
Функция ЗафиксироватьПоНаборуЗаписейСОтборомДляУчетнойЗаписиЭДО(Источник)
	
	ИдентификаторЭДО = Источник.Отбор.ИдентификаторЭДО.Значение; // Строка
	Если Не ЗначениеЗаполнено(ИдентификаторЭДО) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.УчетныеЗаписиЭДО;
	Зафиксировать(ИдентификаторЭДО, ТипДанных, ИдентификаторЭДО);
	
	Возврат Истина;
	
КонецФункции

// Параметры:
//  Источник - см. ЗафиксироватьПоНаборуЗаписейДляУчетнойЗаписиЭДО.Источник
Процедура ЗафиксироватьПоНаборуЗаписейСЗамещениемДляУчетнойЗаписиЭДО(Источник)
	
	ВыгрузкаИзменений = ВыгрузкаИзмененийПоНаборуЗаписейДляУчетнойЗаписиЭДО(Источник);
	Если Не ЗначениеЗаполнено(ВыгрузкаИзменений) Тогда
		Возврат;
	КонецЕсли;
	
	ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.УчетныеЗаписиЭДО;
	Для Каждого ЗаписьВызрузки Из ВыгрузкаИзменений Цикл
		Зафиксировать(ЗаписьВызрузки.ИдентификаторЭДО, ТипДанных, ЗаписьВызрузки.ИдентификаторЭДО);
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  Источник - см. ЗафиксироватьПоНаборуЗаписейДляУчетнойЗаписиЭДО.Источник
Процедура ЗафиксироватьПоНаборуЗаписейБезЗамещенияДляУчетнойЗаписиЭДО(Источник)
	
	ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.УчетныеЗаписиЭДО;
	Для Каждого ЗаписьНабора Из Источник Цикл
		Зафиксировать(ЗаписьНабора.ИдентификаторЭДО, ТипДанных, ЗаписьНабора.ИдентификаторЭДО);
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  Источник - см. ЗафиксироватьПоНаборуЗаписейДляУчетнойЗаписиЭДО.Источник
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//  * ИдентификаторЭДО - Строка
Функция ВыгрузкаИзмененийПоНаборуЗаписейДляУчетнойЗаписиЭДО(Источник)
	Возврат МеткиВремениДанныхЭДО.ВыгрузкаИзмененийПоНаборуЗаписей(Источник);
КонецФункции

// Параметры:
//  ИдентификаторЭДО - См. РегистрСведений.МеткиВремениДанныхЭДО.ИдентификаторЭДО
//  ТипДанных - См. РегистрСведений.МеткиВремениДанныхЭДО.ТипДанных
//  ИдентификаторОбъекта - См. РегистрСведений.МеткиВремениДанныхЭДО.ИдентификаторОбъекта
Процедура Зафиксировать(ИдентификаторЭДО, ТипДанных, ИдентификаторОбъекта) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторЭДО.Установить(ИдентификаторЭДО);
	НаборЗаписей.Отбор.ТипДанных.Установить(ТипДанных);
	НаборЗаписей.Отбор.ИдентификаторОбъекта.Установить(ИдентификаторОбъекта);
	
	ЗаписьНабора = НаборЗаписей.Добавить();
	ЗаписьНабора.ИдентификаторЭДО = ИдентификаторЭДО;
	ЗаписьНабора.ТипДанных = ТипДанных;
	ЗаписьНабора.ИдентификаторОбъекта = ИдентификаторОбъекта;
	ЗаписьНабора.МеткаВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Параметры:
//  ИдентификаторЭДО - Строка
//  ТипДанных - ПеречислениеСсылка.ТипыСинхронизацииСЦентромЭДО
//  ИдентификаторОбъекта - Строка
// 
// Возвращаемое значение:
//  Число
Функция МеткаВремениОбъекта(ИдентификаторЭДО, ТипДанных, ИдентификаторОбъекта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МеткиВремениДанныхЭДО.МеткаВремени
		|ИЗ
		|	РегистрСведений.МеткиВремениДанныхЭДО КАК МеткиВремениДанныхЭДО
		|ГДЕ
		|	МеткиВремениДанныхЭДО.ИдентификаторЭДО = &ИдентификаторЭДО
		|	И МеткиВремениДанныхЭДО.ТипДанных = &ТипДанных
		|	И МеткиВремениДанныхЭДО.ИдентификаторОбъекта = &ИдентификаторОбъекта";
	
	Запрос.УстановитьПараметр("ИдентификаторЭДО", ИдентификаторЭДО);
	Запрос.УстановитьПараметр("ТипДанных", ТипДанных);
	Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.МеткаВремени;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

// Параметры:
//  ИдентификаторЭДО - Строка
//  ТипДанных - ПеречислениеСсылка.ТипыСинхронизацииСЦентромЭДО
//  ИдентификаторыОбъектов - Массив из Строка
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - Строка - идентификатор объекта.
//  * Значение - Число - метка времени.
Функция МеткиВремениОбъектов(ИдентификаторЭДО, ТипДанных, ИдентификаторыОбъектов) Экспорт
	
	МеткаВремениОбъектов = Новый Соответствие; // См. МеткаВремениОбъектов
	
	Для Каждого ИдентификаторОбъекта Из ИдентификаторыОбъектов Цикл
		МеткаВремениОбъектов.Вставить(ИдентификаторОбъекта, 0);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МеткиВремениДанныхЭДО.ИдентификаторОбъекта КАК ИдентификаторОбъекта,
		|	МеткиВремениДанныхЭДО.МеткаВремени КАК МеткаВремени
		|ИЗ
		|	РегистрСведений.МеткиВремениДанныхЭДО КАК МеткиВремениДанныхЭДО
		|ГДЕ
		|	МеткиВремениДанныхЭДО.ИдентификаторЭДО = &ИдентификаторЭДО
		|	И МеткиВремениДанныхЭДО.ТипДанных = &ТипДанных
		|	И МеткиВремениДанныхЭДО.ИдентификаторОбъекта В (&ИдентификаторыОбъектов)";
	
	Запрос.УстановитьПараметр("ИдентификаторЭДО", ИдентификаторЭДО);
	Запрос.УстановитьПараметр("ТипДанных", ТипДанных);
	Запрос.УстановитьПараметр("ИдентификаторыОбъектов", ИдентификаторыОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МеткаВремениОбъектов.Вставить(Выборка.ИдентификаторОбъекта, Выборка.МеткаВремени);
	КонецЦикла;
	
	Возврат МеткаВремениОбъектов;
	
КонецФункции

// Параметры:
//  ИдентификаторЭДО - Строка
//  ТипДанных - ПеречислениеСсылка.ТипыСинхронизацииСЦентромЭДО
// 
// Возвращаемое значение:
//  Число
Функция ПоследняяМеткаВремениОбъектов(ИдентификаторЭДО, ТипДанных) Экспорт
	
	ПоследняяМеткаВремени = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МАКСИМУМ(МеткиВремениДанныхЭДО.МеткаВремени) КАК МеткаВремени
		|ИЗ
		|	РегистрСведений.МеткиВремениДанныхЭДО КАК МеткиВремениДанныхЭДО
		|ГДЕ
		|	МеткиВремениДанныхЭДО.ИдентификаторЭДО = &ИдентификаторЭДО
		|	И МеткиВремениДанныхЭДО.ТипДанных = &ТипДанных";
		
	Запрос.УстановитьПараметр("ИдентификаторЭДО", ИдентификаторЭДО);
	Запрос.УстановитьПараметр("ТипДанных", ТипДанных);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПоследняяМеткаВремени = Выборка.МеткаВремени;
	КонецЕсли;
	
	Возврат ПоследняяМеткаВремени;
	
КонецФункции

// Параметры:
//  ИдентификаторЭДО - Строка
//  ТипДанных - ПеречислениеСсылка.ТипыСинхронизацииСЦентромЭДО
//  ИдентификаторыОбъектов - Массив из Строка
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//  * ИдентификаторОбъекта - Строка
//  * МеткаВремени - Число
Функция ВыбратьМеткиВремениОбъектов(ИдентификаторЭДО, ТипДанных, ИдентификаторыОбъектов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МеткиВремениДанныхЭДО.ИдентификаторОбъекта,
		|	МеткиВремениДанныхЭДО.МеткаВремени
		|ИЗ
		|	РегистрСведений.МеткиВремениДанныхЭДО КАК МеткиВремениДанныхЭДО
		|ГДЕ
		|	МеткиВремениДанныхЭДО.ИдентификаторЭДО = &ИдентификаторЭДО
		|	И МеткиВремениДанныхЭДО.ТипДанных = &ТипДанных
		|	И МеткиВремениДанныхЭДО.ИдентификаторОбъекта В (&ИдентификаторыОбъектов)";
	
	Запрос.УстановитьПараметр("ИдентификаторЭДО", ИдентификаторЭДО);
	Запрос.УстановитьПараметр("ТипДанных", ТипДанных);
	Запрос.УстановитьПараметр("ИдентификаторыОбъектов", ИдентификаторыОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции

#КонецОбласти

#КонецЕсли
